# 代码块
#   代码块中保存着一组代码，同一个代码块中的代码，要么都执行要么都不执行，代码块就是一种为代码分组的机制
#   代码块语句就不能紧随在:后边，而是要写在下一行
#   代码块以缩进开始，直到代码恢复到之前的缩进级别时结束
#
#   缩进有两种方式，一种是使用tab键，一种是使用空格（四个）   Python的官方文档中推荐我们使用空格来缩进
#   Python代码中使用的缩进方式必须统一 否则 "translate_tabs_to_spaces": true,

# 单行
num = 11
if num > 20: print('num比10大！')
print('不受if控制')

# 多行代码块
if num < 20:
    print(123)
    print(456)
print('不受if控制')

# 可以使用逻辑运算符来连接多个条件
if num > 10 and num < 20:
    print('num比10大,num比20小！')

# ------------------------------------------------------------------------
# 获取用户输入的用户名
# ageStr = input('请输入你的年龄:')  # 返回字符串
# age = int(ageStr)
age = 18
if age > 17:
    print('你已经成年了~~')
else:
    print('你还未成年~~')

# ------------------------------------------------------------------------
age = 68
if 18 <= age < 30:
    print('你已经成年了！')
elif 30 <= age < 60:
    print('你已经中年了！')
elif age >= 60:
    print('你已经退休了！')
else:
    print('你还未成年~~')

# ------------------------------------------------------------------------
# 打印分割线
print("=" * 30)

# 获取小明的成绩
score = float(input('请输入你的期末成绩(0-100)：'))
if 0 <= score <= 100:
    if score == 100:
        print('宝马，拿去玩！')
    elif score >= 80:
        print('苹果手机，拿去玩！')
    elif score >= 60:
        print('参考书，拿去玩！')
    else:
        print('棍子一根！')
else:
    print('你输入的内容不合法')
