print('------------------------------------1-----------------------------------------')

i = 0
while i < 5:
    if i == 3:
        break
    print(i)
    i += 1
else:  # 条件表达式为False时执行
    print('循环结束')

print('------------------------------------2-----------------------------------------')

i = 0
while i < 5:
    i += 1
    if i == 2:
        continue
    print(i)
else:
    print('循环结束')

print('====================================3====================================')

sites = ["Baidu", "Google", "Runoob", "Taobao"]

for site in sites:
    if site == "Runoob":
        print("菜鸟教程!")
        break
    print("循环数据 " + site)
else:
    print("没有循环数据!")

print('====================================4====================================')

for site in sites:
    if site == "Runoob":
        print("菜鸟教程!")
        continue
    print("循环数据 " + site)
else:
    print("没有循环数据!")

print('====================================5====================================')

# 遍历数字序列，可以使用内置range()函数。它会生成数列 [0,n-1)
for i in range(5):
    print(i)

print('====================================6====================================')

# 也可以使用range指定区间的值 [a,b)
for i in range(5, 9):
    print(i)

print('====================================7====================================')

# 可以使range以指定数字开始并指定不同的增量(甚至可以是负数，有时这也叫做'步长')
for i in range(0, 10, 3):  # 步长为3
    print(i)

print('====================================8====================================')

# 结合range()和len()函数以遍历一个序列的索引
a = ['Google', 'Baidu', 'Runoob', 'Taobao', 'QQ']
for i in range(len(a)):
    print(i, a[i])

print('====================================9====================================')

# Python pass是空语句，是为了保持程序结构的完整性。pass不做任何事情，一般用做占位语句
for letter in 'Runoob':
    if letter == 'o':
        pass  # 不写语句会报错 用pass占位
    print('当前字母 :', letter)

print("Good bye!")
